List<Map<String, String>> ablutionList = [
  {
    'image': 'assets/teaching_ablution_images/ablution_page.png',
    'text':
        'النبي ﷺ وضح للأمة الوضوء، ارجع إليه ﷺ تفسيرًا لقوله تعالى : " يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلاةِ فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ وَامْسَحُوا بِرُءُوسِكُمْ وَأَرْجُلَكُمْ إِلَى الْكَعْبَيْنِ " [ المائدة:6 ] فسره النبي ﷺ بفعله للصحابة كالآتي.',
  },
  {
    'image': 'assets/teaching_ablution_images/step1.png',
    'text':
        'استحضار النيّة\nفلا يصحّ الوضوء إلّا بنية رفع الحدث الذي منع من العبادة.\n\nالتسمية بالله\nوهو أن يقول: بسم الله الرحمن الرحيم.',
  },
  {
    'image': 'assets/teaching_ablution_images/step2.png',
    'text':
        'غسل الكف ثلاثاً\nوحكم غسل الكفين ثلاث مرّاتٍ سنة، والدليل هو حديث عثمان بن عفان رضي الله عنه، الذي يتضمّن صفة وضوء الرسول عليه الصلاة والسلام، حيث قال: (دعا بوَضوءٍ، فتوضأ، فغسل كَفَّيْهِ ثلاثَ مراتٍ)،\nوقد صرف غسل الكفين عن الوجوب عدم ذكر الله -تعالى- لها في قوله: (يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلَاةِ فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ وَامْسَحُوا بِرُءُوسِكُمْ وَأَرْجُلَكُمْ إِلَى الْكَعْبَيْنِ).\n\n',
  },
  {
    'image': 'assets/teaching_ablution_images/step3.png',
    'text':
        'المضمضة\n وتعرّف المضمضة بأنّها إدارة الماء في الفم، ويُستحبّ تكرار المضمضه ثلاث مرّاتٍ.',
  },
  {
    'image': 'assets/teaching_ablution_images/step4.png',
    'text':
        'الاستنشاق\nوهو اجتذاب الماء بالنفس، فقد ورد في حديث عثمان -رضي الله عنه- في صفة وضوء النبي عليه الصلاة والسلام، حيث قال: (فمضمض واستنثر، ثمّ غسل وجهَه ثلاثَ مراتٍ)،\n\n',
  },
  {
    'image': 'assets/teaching_ablution_images/step5.png',
    'text':
        'غسل الوجه ثلاثًا\nثم يغسل المسلم وجهه، وحدوده من أعلى الجبهة إلى أسفل اللحية طولاً، ومن الأذن إلى الأذن عرضاً، ويُستحبّ غسله ثلاث مرّاتٍ، لحديث عثمان -رضي الله عنه- في صفة وضوء النبي عليه الصلاة والسلام، حيث قال: (ثم غسل وجهَه ثلاثَ مراتٍ).',
  },
  {
    'image': 'assets/teaching_ablution_images/step6.png',
    'text':
        'غسل اليدين إلى المرفقين ثلاثًا\nثم يغسل المسلم يديه إلى المرفقين، ويكون الغسل من الأصابع إلى المرفق، ويستحبّ غسلها ثلاث مرات لحديث عثمان -رضي الله عنه- في صفة وضوء النبي عليه الصلاة والسلام، حيث قال: (ثم غسل يدَه اليُمْنَى إلى المِرفَقِ ثلاثَ مراتٍ، ثم غسل يدَه اليُسْرَى مِثْلَ ذلك).',
  },
  {
    'image': 'assets/teaching_ablution_images/step7.png',
    'text': 'مسح الرأس والأذنين\nثم يمسح المسلم رأسه، ويمسح أذنيه.',
  },
  {
    'image': 'assets/teaching_ablution_images/doaa.png',
    'text':
        'الدعاء بعد الوضوء\nويدعو بعد الانتهاء بالدعاء المأثور عن النبي "أشهد أن لا إله إلا الله، وحده، لا شريك له، وأشهد أن محمدًا عبده ورسوله. وفي الترمذي: اللهم اجعلني من التوابين، واجعلني من المتطهرين. وفي عمل اليوم والليلة للنسائي: سبحانك الله وبحمدك، أشهد أن لا إله إلا أنت، أستغفرك، وأتوب إليك.',
  },
  {
    'image': 'assets/teaching_ablution_images/step1.png',
    'text': '',
  },
];
