List<Map<String, String>> prayList = [
  {
    'image': 'assets/images/muslim-prayer.png',
    'text':
        'الحمد لله والصلاة والسلام على رسول الله أما بعد …\nفكثير من المسلمين - هداهم الله – لا يحسنون الكيفية الصحيحة للصلاة إما جهلاً أو عدم حرص على أدائها على الوجه المشروع ….\nقال الشيخ / محمد بن عثيمين رحمه الله :الصلة: عبادة ذات أقوال وأفعال أولها التكبير وآخرها التسليم. وإذا أراد الصلاة فإنه يجب عليه أن يتوضأ إن كان عليه حدث أصغر، أو يغتسل إن كان عليه حدث أكبر، أو يتيمم إن لم يجد الماء أو تضرر باستعماله، وينظف بدنه وثوبه ومكان صلاته من النجاسة.',
  },
  {
    'image': 'assets/teaching_pray_images/step4.png',
    'text':
        '1 - أن يستقبل القبلة بجميع بدنه بدون انحراف ولا التفات.\n\n2 - ثم ينوي الصلاة التي يريد أن يصليها بقلبه بدون نطق النية.\n\n',
  },
  {
    'image': 'assets/teaching_pray_images/step5.png',
    'text':
        '3 - ثم يكبر تكبيرة الإحرام فيقول: (الله أكبر) ويرفع يديه إلى حذو منكبيه عند التكبير.',
  },
  {
    'image': 'assets/teaching_pray_images/step6.png',
    'text':
        '4 - ثم يضع كف يده اليمنى على ظهر كف يده اليسرى فوق صدره.\n\n5 - ثم يستفتح فيقول: (اللهم باعد بيني وبين خطاياي كما باعدت بين المشرق والمغرب. اللهم نقني من خطاياي كما يُنقى الثوب الأبيض من الدنس. اللهم اغسلني من خطاياي بالماء والثلج والبرد).\nأو يقول: (سبحانك اللهم وبحمدك، وتبارك اسمك، وتعالى جدك، ولا إله غيرك).\n\n6 - ثم يتعوذ فيقول: (أعوذ بالله من الشيطان الرجيم).\n\n7 - ثم يبسمل ويقرأ الفاتحة ثم يقول (آمين) يعني اللهم استجب.\n8 - ثم يقرأ ما تيسر من القرآن ويطيل القراءة في صلاة الصبح.\n',
  },
  {
    'image': 'assets/teaching_pray_images/step7.png',
    'text':
        '9 - ثم يركع، أي يحني ظهره تعظيماً لله ويُكبر عند ركوعه ويرفع يديه إلى حذو منكبيه. والسنة أن يهصر ظهره ويجعل رأسه حياله ويضع يديه على ركبتيه مفرجتي الأصابع.\n\n10 - ويقول في ركوعه: (سبحان ربي العظيم) ثلاث مرات، وإن زاد: (سبحانك اللهم وبحمدك، اللهم اغفر لي) فحسن.\n\n',
  },
  {
    'image': 'assets/teaching_pray_images/step8.png',
    'text':
        '11 - ثم يرفع رأسه من الركوع قائلاً: (سمع الله لمن حمده) ويرفع يديه حينئذ إلى حذو منكبيه. والمأموم لا يقول سمع الله لمن حمده، وإنما يقول بدلها: (ربنا ولك الحمد).\n\n12 - ثم يقول بعد رفعه: (ربنا ولك الحمد، ملء السماوات والأرض وملء ما شئت من شيء بعد).',
  },
  {
    'image': 'assets/teaching_pray_images/step9.png',
    'text':
        '13 - ثم يسجد خشوعاً السجدة الأولى ويقول عند سجوده: (الله أكبر) ويسجد على أعضائه السبعة: الجبهة والأنف، والكفين، والركبتين، وأطراف القدمين، ويجافي عضديه عن جنبيه ولا يبسط ذراعيه على الأرض، ويتسبقل برؤوس أصابعه القبلة.\n\n14 - ويقول في سجوده: (سبحان ربي الأعلى) ثلاث مرات، وإن زاد: (سبحانك اللهم ربنا وبحمدك، اللهم اغفر لي) فحسن.',
  },
  {
    'image': 'assets/teaching_pray_images/step10.png',
    'text':
        '15 - ثم يرفع رأسه من السجود قائلاً: (الله أكبر).\n\n16 - ثم يجلس بين السجدتين على قدمه اليسرى، وينصب قدمه اليمنى، ويضع يده اليمنى على طرف فخذه الأيمن مما يلي ركبته، ويقبض منها الخنصر والبنصر، ويرفع السبابة ويحركها عند دعائه، ويجعل طرف الإبهام مقروناً بطرف الوسطى كالحلقة، ويضع يده اليسرى مبسوطة الأصابع على طرف فخذه الأيسر مما يلي الركبة.\n\n17 - ويقول في جلوسه بين السجدتين: (رب اغفر لي وارحمني واهدني وارزقني واجبرني وعافني).\n\n',
  },
  {
    'image': 'assets/teaching_pray_images/step9.png',
    'text':
        '18 - ثم يسجد خشوعاً منه السجدة الثانية كالأولى فيما يُقال ويُفعل، ويكبر عند سجوده.',
  },
  {
    'image': 'assets/teaching_pray_images/step6.png',
    'text':
        '19 - ثم يقوم من السجدة الثانية قائلاً: (الله أكبر) ويصلي الركعة الثانية كالأولى فيما يُقال ويفعل إلا أنه لا يستفتح فيها.',
  },
  {
    'image': 'assets/teaching_pray_images/step11.png',
    'text':
        '20 - ثم يجلس بعد انتهاء الركعة الثانية قائلاً: (الله أكبر) ويجلس كما يجلس بين السجدتين سواء.\n\n21 - ويقرأ التشهد في هذا الجلوس فيقول: (التحيات لله والصلوات والطيبات، السلام عليك أيها النبي ورحمة الله وبركاته، السلام علينا وعلى عباد الله الصالحين، أشهد أن لا إله إلا الله وأشهد أن محمداً عبده ورسوله، اللهم صلِّ على محمد وعلى آل محمد كما صليت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد، وبارك على محمد وعلى آل محمد كما باركت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد. أعوذ بالله من عذاب جهنم، ومن عذاب القبر، ومن فتنة المحيا والممات، ومن فتنة المسيح الدجال) ثم يدعو ربه بما أحب من خيري الدنيا والآخرة.',
  },
  {
    'image': 'assets/teaching_pray_images/step12.png',
    'text':
        '22 - ثم يسلم عن يمينه قائلاً: (السلام عليكم ورحمة الله) وعن يساره كذلك.',
  },
  {
    'image': 'assets/teaching_pray_images/step8.png',
    'text':
        '23 - وإذا كانت الصلاة ثلاثية أو رباعية وقف عند منتهى التشهد الأول وهو: (أشهد أن لا إله إلا الله وأشهد أن محمداً عبده ورسوله).\n\n24 - ثم ينهض قائماً قائلاً: (الله أكبر) ويرفع يديه إلى حذو منكبيه حينئذ.\n\n25 - ثم يصلي ما بقي من صلاته على صفة الركعة الثانية، إلا أنه يقتصر على قراءة الفاتحة.',
  },
  {
    'image': 'assets/teaching_pray_images/step12.png',
    'text':
        '26 - ثم يجلس متوركاً فينصب قدمه اليمنى ويخرج قدمه اليسرى من تحت ساق اليمنى ويُمكن مقعدته من الأرض، ويضع يديه على فخذيه على صفة وضعها في التشهد الأول.\n\n27 - ويقرأ في هذا الجلوس التشهد كله.\n\n28 - ثم يسلم عن يمينه قائلاً: (السلام عليكم ورحمة الله) وعن يساره كذلك.',
  },
];
