import 'package:flutter/material.dart';
import '../../service/navigation_bottom_bar.dart';
import 'teaching_pray_item.dart';

class TeachingPray extends StatelessWidget {
  TeachingPray({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      bottomNavigationBar: CustomBottomNavigationBar(),
      appBar: AppBar(
        backgroundColor: Colors.teal,
        title: Text('TeachingPray'),
      ),
      body: SingleChildScrollView(
        physics: BouncingScrollPhysics(),
        child: Column(
          children: [
            TeachingPrayItem(
              text:
                  'تأكد من أن المحيط طاهر وخالي من النجاسات. وهذا يشمل جسدك وملابسك، ومكان الصلاة نفسه.\nتوضأ إن لم تكن على وضوء. فالطهارة شرط من شروط الصلاة، توضأ قبل الصلاة في حالة قيامك بالتبول، التبرز أو أطلقت الغازات أو حدوث نزيف لك أو نمت أو غفوت أو تقيأت أو أُغمى عليك، في كل هذه الأحوال يجب عليك أن تتوضأ مرة أخرى.\n \nتأكد من تغطية جميع عوراتك. وهي عند الرجل ما بين السُرة والركبة؛ أما المرأة، جسدها بأكمله، عدا الوجه والكفين.\nإن كنت تصلي في المسجد، وذلك أفضل، أدخل المسجد بهدوء؛ وذلك حتى لا تزعج غيرك من المصلين.\n قف في مساحة خالية بعيدًا عن باب الدخول أو الخروج من المسجد.\nفي حالة نظافة المنطقة التي ترغب أن تصلي بها، ابسط قطعة من الحصير أو القماش لتستوي الأرض. \n',
              image: 'step1',
            ),
            TeachingPrayItem(
              text:
                  'تأكد من أن المحيط طاهر وخالي من النجاسات. وهذا يشمل جسدك وملابسك، ومكان الصلاة نفسه.\nتوضأ إن لم تكن على وضوء. فالطهارة شرط من شروط الصلاة، توضأ قبل الصلاة في حالة قيامك بالتبول، التبرز أو أطلقت الغازات أو حدوث نزيف لك أو نمت أو غفوت أو تقيأت أو أُغمى عليك، في كل هذه الأحوال يجب عليك أن تتوضأ مرة أخرى.\n \nتأكد من تغطية جميع عوراتك. وهي عند الرجل ما بين السُرة والركبة؛ أما المرأة، جسدها بأكمله، عدا الوجه والكفين.\nإن كنت تصلي في المسجد، وذلك أفضل، أدخل المسجد بهدوء؛ وذلك حتى لا تزعج غيرك من المصلين.\n قف في مساحة خالية بعيدًا عن باب الدخول أو الخروج من المسجد.\nفي حالة نظافة المنطقة التي ترغب أن تصلي بها، ابسط قطعة من الحصير أو القماش لتستوي الأرض. \n',
              image: 'step2',
            ),
            TeachingPrayItem(
              text:
                  'تأكد من أن المحيط طاهر وخالي من النجاسات. وهذا يشمل جسدك وملابسك، ومكان الصلاة نفسه.\nتوضأ إن لم تكن على وضوء. فالطهارة شرط من شروط الصلاة، توضأ قبل الصلاة في حالة قيامك بالتبول، التبرز أو أطلقت الغازات أو حدوث نزيف لك أو نمت أو غفوت أو تقيأت أو أُغمى عليك، في كل هذه الأحوال يجب عليك أن تتوضأ مرة أخرى.\n \nتأكد من تغطية جميع عوراتك. وهي عند الرجل ما بين السُرة والركبة؛ أما المرأة، جسدها بأكمله، عدا الوجه والكفين.\nإن كنت تصلي في المسجد، وذلك أفضل، أدخل المسجد بهدوء؛ وذلك حتى لا تزعج غيرك من المصلين.\n قف في مساحة خالية بعيدًا عن باب الدخول أو الخروج من المسجد.\nفي حالة نظافة المنطقة التي ترغب أن تصلي بها، ابسط قطعة من الحصير أو القماش لتستوي الأرض. \n',
              image: 'step3',
            ),
            TeachingPrayItem(
              text:
                  'تأكد من أن المحيط طاهر وخالي من النجاسات. وهذا يشمل جسدك وملابسك، ومكان الصلاة نفسه.\nتوضأ إن لم تكن على وضوء. فالطهارة شرط من شروط الصلاة، توضأ قبل الصلاة في حالة قيامك بالتبول، التبرز أو أطلقت الغازات أو حدوث نزيف لك أو نمت أو غفوت أو تقيأت أو أُغمى عليك، في كل هذه الأحوال يجب عليك أن تتوضأ مرة أخرى.\n \nتأكد من تغطية جميع عوراتك. وهي عند الرجل ما بين السُرة والركبة؛ أما المرأة، جسدها بأكمله، عدا الوجه والكفين.\nإن كنت تصلي في المسجد، وذلك أفضل، أدخل المسجد بهدوء؛ وذلك حتى لا تزعج غيرك من المصلين.\n قف في مساحة خالية بعيدًا عن باب الدخول أو الخروج من المسجد.\nفي حالة نظافة المنطقة التي ترغب أن تصلي بها، ابسط قطعة من الحصير أو القماش لتستوي الأرض. \n',
              image: 'step4',
            ),
            TeachingPrayItem(
              text:
                  'تأكد من أن المحيط طاهر وخالي من النجاسات. وهذا يشمل جسدك وملابسك، ومكان الصلاة نفسه.\nتوضأ إن لم تكن على وضوء. فالطهارة شرط من شروط الصلاة، توضأ قبل الصلاة في حالة قيامك بالتبول، التبرز أو أطلقت الغازات أو حدوث نزيف لك أو نمت أو غفوت أو تقيأت أو أُغمى عليك، في كل هذه الأحوال يجب عليك أن تتوضأ مرة أخرى.\n \nتأكد من تغطية جميع عوراتك. وهي عند الرجل ما بين السُرة والركبة؛ أما المرأة، جسدها بأكمله، عدا الوجه والكفين.\nإن كنت تصلي في المسجد، وذلك أفضل، أدخل المسجد بهدوء؛ وذلك حتى لا تزعج غيرك من المصلين.\n قف في مساحة خالية بعيدًا عن باب الدخول أو الخروج من المسجد.\nفي حالة نظافة المنطقة التي ترغب أن تصلي بها، ابسط قطعة من الحصير أو القماش لتستوي الأرض. \n',
              image: 'step5',
            ),
            TeachingPrayItem(
              text:
                  'تأكد من أن المحيط طاهر وخالي من النجاسات. وهذا يشمل جسدك وملابسك، ومكان الصلاة نفسه.\nتوضأ إن لم تكن على وضوء. فالطهارة شرط من شروط الصلاة، توضأ قبل الصلاة في حالة قيامك بالتبول، التبرز أو أطلقت الغازات أو حدوث نزيف لك أو نمت أو غفوت أو تقيأت أو أُغمى عليك، في كل هذه الأحوال يجب عليك أن تتوضأ مرة أخرى.\n \nتأكد من تغطية جميع عوراتك. وهي عند الرجل ما بين السُرة والركبة؛ أما المرأة، جسدها بأكمله، عدا الوجه والكفين.\nإن كنت تصلي في المسجد، وذلك أفضل، أدخل المسجد بهدوء؛ وذلك حتى لا تزعج غيرك من المصلين.\n قف في مساحة خالية بعيدًا عن باب الدخول أو الخروج من المسجد.\nفي حالة نظافة المنطقة التي ترغب أن تصلي بها، ابسط قطعة من الحصير أو القماش لتستوي الأرض. \n',
              image: 'step6',
            ),
            TeachingPrayItem(
              text:
                  'تأكد من أن المحيط طاهر وخالي من النجاسات. وهذا يشمل جسدك وملابسك، ومكان الصلاة نفسه.\nتوضأ إن لم تكن على وضوء. فالطهارة شرط من شروط الصلاة، توضأ قبل الصلاة في حالة قيامك بالتبول، التبرز أو أطلقت الغازات أو حدوث نزيف لك أو نمت أو غفوت أو تقيأت أو أُغمى عليك، في كل هذه الأحوال يجب عليك أن تتوضأ مرة أخرى.\n \nتأكد من تغطية جميع عوراتك. وهي عند الرجل ما بين السُرة والركبة؛ أما المرأة، جسدها بأكمله، عدا الوجه والكفين.\nإن كنت تصلي في المسجد، وذلك أفضل، أدخل المسجد بهدوء؛ وذلك حتى لا تزعج غيرك من المصلين.\n قف في مساحة خالية بعيدًا عن باب الدخول أو الخروج من المسجد.\nفي حالة نظافة المنطقة التي ترغب أن تصلي بها، ابسط قطعة من الحصير أو القماش لتستوي الأرض. \n',
              image: 'step7',
            ),
            TeachingPrayItem(
              text:
                  'تأكد من أن المحيط طاهر وخالي من النجاسات. وهذا يشمل جسدك وملابسك، ومكان الصلاة نفسه.\nتوضأ إن لم تكن على وضوء. فالطهارة شرط من شروط الصلاة، توضأ قبل الصلاة في حالة قيامك بالتبول، التبرز أو أطلقت الغازات أو حدوث نزيف لك أو نمت أو غفوت أو تقيأت أو أُغمى عليك، في كل هذه الأحوال يجب عليك أن تتوضأ مرة أخرى.\n \nتأكد من تغطية جميع عوراتك. وهي عند الرجل ما بين السُرة والركبة؛ أما المرأة، جسدها بأكمله، عدا الوجه والكفين.\nإن كنت تصلي في المسجد، وذلك أفضل، أدخل المسجد بهدوء؛ وذلك حتى لا تزعج غيرك من المصلين.\n قف في مساحة خالية بعيدًا عن باب الدخول أو الخروج من المسجد.\nفي حالة نظافة المنطقة التي ترغب أن تصلي بها، ابسط قطعة من الحصير أو القماش لتستوي الأرض. \n',
              image: 'step8',
            ),
            TeachingPrayItem(
              text:
                  'تأكد من أن المحيط طاهر وخالي من النجاسات. وهذا يشمل جسدك وملابسك، ومكان الصلاة نفسه.\nتوضأ إن لم تكن على وضوء. فالطهارة شرط من شروط الصلاة، توضأ قبل الصلاة في حالة قيامك بالتبول، التبرز أو أطلقت الغازات أو حدوث نزيف لك أو نمت أو غفوت أو تقيأت أو أُغمى عليك، في كل هذه الأحوال يجب عليك أن تتوضأ مرة أخرى.\n \nتأكد من تغطية جميع عوراتك. وهي عند الرجل ما بين السُرة والركبة؛ أما المرأة، جسدها بأكمله، عدا الوجه والكفين.\nإن كنت تصلي في المسجد، وذلك أفضل، أدخل المسجد بهدوء؛ وذلك حتى لا تزعج غيرك من المصلين.\n قف في مساحة خالية بعيدًا عن باب الدخول أو الخروج من المسجد.\nفي حالة نظافة المنطقة التي ترغب أن تصلي بها، ابسط قطعة من الحصير أو القماش لتستوي الأرض. \n',
              image: 'step9',
            ),
            TeachingPrayItem(
              text:
                  'تأكد من أن المحيط طاهر وخالي من النجاسات. وهذا يشمل جسدك وملابسك، ومكان الصلاة نفسه.\nتوضأ إن لم تكن على وضوء. فالطهارة شرط من شروط الصلاة، توضأ قبل الصلاة في حالة قيامك بالتبول، التبرز أو أطلقت الغازات أو حدوث نزيف لك أو نمت أو غفوت أو تقيأت أو أُغمى عليك، في كل هذه الأحوال يجب عليك أن تتوضأ مرة أخرى.\n \nتأكد من تغطية جميع عوراتك. وهي عند الرجل ما بين السُرة والركبة؛ أما المرأة، جسدها بأكمله، عدا الوجه والكفين.\nإن كنت تصلي في المسجد، وذلك أفضل، أدخل المسجد بهدوء؛ وذلك حتى لا تزعج غيرك من المصلين.\n قف في مساحة خالية بعيدًا عن باب الدخول أو الخروج من المسجد.\nفي حالة نظافة المنطقة التي ترغب أن تصلي بها، ابسط قطعة من الحصير أو القماش لتستوي الأرض. \n',
              image: 'step10',
            ),
            TeachingPrayItem(
              text:
                  'تأكد من أن المحيط طاهر وخالي من النجاسات. وهذا يشمل جسدك وملابسك، ومكان الصلاة نفسه.\nتوضأ إن لم تكن على وضوء. فالطهارة شرط من شروط الصلاة، توضأ قبل الصلاة في حالة قيامك بالتبول، التبرز أو أطلقت الغازات أو حدوث نزيف لك أو نمت أو غفوت أو تقيأت أو أُغمى عليك، في كل هذه الأحوال يجب عليك أن تتوضأ مرة أخرى.\n \nتأكد من تغطية جميع عوراتك. وهي عند الرجل ما بين السُرة والركبة؛ أما المرأة، جسدها بأكمله، عدا الوجه والكفين.\nإن كنت تصلي في المسجد، وذلك أفضل، أدخل المسجد بهدوء؛ وذلك حتى لا تزعج غيرك من المصلين.\n قف في مساحة خالية بعيدًا عن باب الدخول أو الخروج من المسجد.\nفي حالة نظافة المنطقة التي ترغب أن تصلي بها، ابسط قطعة من الحصير أو القماش لتستوي الأرض. \n',
              image: 'step11',
            ),
            TeachingPrayItem(
              text:
                  'تأكد من أن المحيط طاهر وخالي من النجاسات. وهذا يشمل جسدك وملابسك، ومكان الصلاة نفسه.\nتوضأ إن لم تكن على وضوء. فالطهارة شرط من شروط الصلاة، توضأ قبل الصلاة في حالة قيامك بالتبول، التبرز أو أطلقت الغازات أو حدوث نزيف لك أو نمت أو غفوت أو تقيأت أو أُغمى عليك، في كل هذه الأحوال يجب عليك أن تتوضأ مرة أخرى.\n \nتأكد من تغطية جميع عوراتك. وهي عند الرجل ما بين السُرة والركبة؛ أما المرأة، جسدها بأكمله، عدا الوجه والكفين.\nإن كنت تصلي في المسجد، وذلك أفضل، أدخل المسجد بهدوء؛ وذلك حتى لا تزعج غيرك من المصلين.\n قف في مساحة خالية بعيدًا عن باب الدخول أو الخروج من المسجد.\nفي حالة نظافة المنطقة التي ترغب أن تصلي بها، ابسط قطعة من الحصير أو القماش لتستوي الأرض. \n',
              image: 'step12',
            ),
          ],
        ),
      ),
    );
  }
}
